APIDockableFrameManager.m_idMap
Maps a pane Id to its associated data.

APIDockableFrameManager.findPaneData(DockablePaneId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Finds and retrieves dockable pane data by its identifier.
id: The unique identifier of the dockable pane to find.
Returns: A pointer to the dockable pane data if found, or nullptr if not found.

APIDockableFrameManager.loadDefaultState(MFCDockableFrameHost*,Autodesk.Revit.UI.DockablePaneProviderData)
Attempts to apply the default docking layout for a registered pane
using the configuration data supplied by its provider at registration time.
pHostPane: The host pane whose default state is to be loaded.
paneData: The provider data describing the pane's desired default docking position.

APIDockableFrameManager.enableFrames(System.Boolean)
Toggles the enable state of all registered frames.
enable: The enable state to set for the frames.

APIDockableFrameManager.getDockablePaneFrame(DockablePaneId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
Returns the MFCDockableFrame associated with the given Id.
id: The id of the pane to lookup.
createIfNotFound: If true, the frame will be created when it does not already exist.
Returns: Pointer to the MFCDockableFrame associated with the Id, null if not found.

APIDockableFrameManager.isIdRegistered(DockablePaneId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Validates whether the given dockable pane id has been registered.
id: The DockablePaneId to lookup.
Returns: true if found, false otherwise.

APIDockableFrameManager.loadLayout(Arr&lt;RestoredPaneInfo&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a host pane for every registered pane.
Default state is applied to any registered pane that was not restored.
restoredPanes: The panes that were restored together with their restored visibility state.

APIDockableFrameManager.getViewClass
Return the Runtime Class used to dynamically construct the View Object.

APIDockableFrameManager.getFrameClass
Implementation
Return the Runtime Class used to dynamically construct Window Frame Object.

APIDockableFrameManager.onViewDestroy(APIDockableView*)
Called when an APIDockableView is about to be destroyed.
Clears the view association from its corresponding pane data in the registry.
pView: Pointer to the APIDockableView being destroyed.

APIDockableFrameManager.onViewCreate(APIDockableView*,DockablePaneId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Callbacks
Called when an APIDockableView has been created for a registered pane.
Associates the view with its corresponding pane data in the registry.
pView: Pointer to the newly created APIDockableView.
paneId: The identifier of the dockable pane the view belongs to.

APIDockableFrameManager.registerPane(DockablePaneId,AString,Autodesk.Revit.UI.IDockablePaneProvider)
Interface
Registers a new dockable pane with the given identifier, title, and content provider.
id: The unique identifier for the dockable pane.
title: The display title shown in the pane's title bar.
provider: The provider that supplies the pane's content and default docking configuration.
Returns: true if the pane was successfully registered, false if registration failed
(e.g., the identifier is already registered).

APIDockableFrameManager.Dispose
Destroys the APIDockableFrameManager and releases all managed pane resources.

APIDockableFrameManager.#ctor
Construction/Destruction
Constructs a new APIDockableFrameManager instance.

APIDockableFrameManager
Provides management and bridge to the UI for Dockable Panes registered
via the API. Owns the registry of pane identifiers to their associated
data and coordinates the frame and view lifecycle for all API-registered
dockable panes.